leetcode_1187_make_array_strictly_increasing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 1187. Make Array Strictly Increasing</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 1187. Make Array Strictly Increasing</h1>
<p>
<a href="https://leetcode.com/problems/make-array-strictly-increasing/">Problem Statement</a>
</p>

<ul class="org-ul">
<li><a href="mistake_misread_the_problem.html#ID-192401C2-DA6F-4496-B530-89A3546712FD">Mistake: Misread the problem</a>.</li>

<li><a href="blackbox_the_dependent_problem_needs_to_be_optimized.html#ID-EC7DFA39-8E96-4EF7-9297-FAEE2ABF0849">Blackbox: The dependent problem needs to be optimized</a>.  I have to make the choice for the \(i\) item in \(O(1)\) or \(O(\log n)\) otherwise the solution will exceed the time limit.</li>

<li><a href="pattern_find_optimal_subsequence.html#ID-74F32EE1-D1C9-4EC8-A447-9F87FB5E1D28">Pattern: Find optimal subsequence</a>.</li>

<li><a href="can_we_formulate_the_problem_as_a_classical_problem.html#ID-1CFF662A-6F16-43CE-BB07-EA12BA382690">Can we formulate the problem as a classical problem?</a>  It reminds <a href="longest_increasing_subsequence.html#ID-665B7733-6D7E-4A34-8F77-7E64747CE2C9">Longest Increasing Subsequence</a>, since we have to change the given array to become one be LIS.  For each item \(i\), we should take the best of either keeping it as the original value or changing it with one of the backup numbers.  Time complexity is \(O(n^2 \log n)\) and space complexity is \(O(n^2)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List
<span style="font-weight: bold;">from</span> bisect <span style="font-weight: bold;">import</span> bisect_right


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">makeArrayIncreasing</span>(<span style="font-weight: bold;">self</span>, a1: List[<span style="font-weight: bold;">int</span>], a2: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(a1)
        <span style="font-weight: bold; font-style: italic;">M</span> = <span style="font-weight: bold;">len</span>(a2)
        a1.append(<span style="font-weight: bold;">float</span>(<span style="font-style: italic;">"+inf"</span>))
        a2.sort()

        <span style="font-weight: bold; font-style: italic;">dp</span> = [[0] * (M + 1) <span style="font-weight: bold;">for</span> _ <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N + 1)]
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N - 1, -1, -1):
            <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(M, -1, -1):
                <span style="font-weight: bold; font-style: italic;">e</span> = 1 <span style="font-weight: bold;">if</span> j &gt; 0 <span style="font-weight: bold;">else</span> 0
                <span style="font-weight: bold; font-style: italic;">a</span> = a1[i] <span style="font-weight: bold;">if</span> j == 0 <span style="font-weight: bold;">else</span> a2[j - 1]
                b = (e + dp[i + 1][0]) <span style="font-weight: bold;">if</span> a &lt; a1[i + 1] <span style="font-weight: bold;">else</span> <span style="font-weight: bold;">float</span>(<span style="font-style: italic;">"+inf"</span>)
                k = bisect_right(a2, a)
                <span style="font-weight: bold;">if</span> k &lt; <span style="font-weight: bold;">len</span>(a2):
                    b = <span style="font-weight: bold;">min</span>(b, e + dp[i + 1][k + 1])
                dp[i][<span style="font-weight: bold; font-style: italic;">j</span>] = b

        ans = <span style="font-weight: bold;">min</span>(dp[0][0], dp[0][1])
        <span style="font-weight: bold;">return</span> -1 <span style="font-weight: bold;">if</span> ans == <span style="font-weight: bold;">float</span>(<span style="font-style: italic;">"inf"</span>) <span style="font-weight: bold;">else</span> ans


<span style="font-weight: bold;">assert</span> Solution().makeArrayIncreasing([1, 5, 3, 6, 7], [1, 3, 2, 4]) == 1
<span style="font-weight: bold;">assert</span> Solution().makeArrayIncreasing([1, 5, 3, 6, 7], [4, 3, 1]) == 2
<span style="font-weight: bold;">assert</span> Solution().makeArrayIncreasing([1, 5, 3, 6, 7], [1, 6, 3, 3]) == -1
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">makeArrayIncreasing</span>(<span style="font-weight: bold;">self</span>, a1: List[<span style="font-weight: bold;">int</span>], a2: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold;">int</span>:
        a2.append(<span style="font-weight: bold;">float</span>(<span style="font-style: italic;">"inf"</span>))
        a2.sort()
        N = <span style="font-weight: bold;">len</span>(a1)
        <span style="font-weight: bold; font-style: italic;">M</span> = <span style="font-weight: bold;">len</span>(a2)

        <span style="font-weight: bold; text-decoration: underline;">@cache</span>
        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">dfs</span>(i, last):
            <span style="font-weight: bold;">if</span> last == <span style="font-weight: bold;">float</span>(<span style="font-style: italic;">"inf"</span>):
                <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">float</span>(<span style="font-style: italic;">"inf"</span>)
            <span style="font-weight: bold;">if</span> i == N:
                <span style="font-weight: bold;">return</span> 0
            <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">min</span>(
                dfs(i + 1, a1[i]) <span style="font-weight: bold;">if</span> a1[i] &gt; last <span style="font-weight: bold;">else</span> <span style="font-weight: bold;">float</span>(<span style="font-style: italic;">"inf"</span>),
                1 + dfs(i + 1, a2[bisect_right(a2, last)]),
            )

        ans = dfs(0, <span style="font-weight: bold;">float</span>(<span style="font-style: italic;">"-inf"</span>))
        <span style="font-weight: bold;">return</span> -1 <span style="font-weight: bold;">if</span> ans == <span style="font-weight: bold;">float</span>(<span style="font-style: italic;">"inf"</span>) <span style="font-weight: bold;">else</span> ans
</pre>
</div>
</div>
</body>
</html>